
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_PASS
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
* Replace
  * azurerm_role_assignment.vmuser_login[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
        id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-password/f7440fb51f0242868e457e404a403c81"
        name                    = "postgresdb-password"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.vmuser_login[0] must be replaced
-/+ resource "azurerm_role_assignment" "vmuser_login" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/providers/Microsoft.Authorization/roleAssignments/59ef5ae6-10c7-0548-2b21-f89f5ed7f647" -> (known after apply)
      ~ name                             = "59ef5ae6-10c7-0548-2b21-f89f5ed7f647" -> (known after apply)
      ~ principal_id                     = "3fdd1d36-76b0-4048-8a7a-81395e23ca65" -> "ad922d96-041a-4fd0-ac58-9205d3e5b33d" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.108.242",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":656,"Program":"tfcmt","SHA1":"","Vars":{}} -->